{
    "commandExecutionError": "There was an error executing this command",
    "commandNotFound": "The command `<command>` does not exist",
    "missingPermissions": "Missing permissions: `<permissions>`",

    "clear": {
        "description": "Clear an amount of messages from a channel",
        "help": "Usage of the `clear` command: `clear <amount>` where <amount> is the amount of messages to delete.\n<amount> must be between 1 and 100",
        "atLeastOne": "Sorry but you must at least delete one message !",
        "atMostHundred": "Sorry but I can't clean more than 100 messages",
        "nan": "Please enter a number as an argument !",
        "noArg": "Please enter the amount of messages you want to clear, eg : !clear 5"
    },

    "help": {
        "description": "Display the list of all available commands",
        "help": "Use `<prefix>help <command>` to display help for the command `<command>`\n\nAll command's arguments will be surounded with <>",
        "embedTitle": "List of available commands",
        "embedDescription": "Use `<prefix>help <command>` to display help for the command `<command>`\n\n",
        "embedCommandTitle": "Help for `<command>`"
    },

    "language": {
        "description": "Command allowing to set the bot's prefered language",
        "help": "Usage of the `language` command: `language <language>` where <language> is the language in which the bot should respond.\n\nTo see all the available languages, use this command with no arguments",
        "current": "The bot answers in English !",
        "notSupported": "**<language>** can not be handled at the moment. Here is the list of supported languages:\n<list>",
        "updated": "The bot's language has been changed !"
    },  

    "ping": {
        "description": "ping command, responds with pong",
        "help": "This command takes no arguments, it is the basic command to check that the bot is online"
    },

    "prefix": {
        "description": "Command allowing to set the prefix for the commands",
        "help": "`prefix` command usage : `<prefix>prefix <newPrefix>` where <newPrefix> is the prefix that will be used to call bot's commands",
        "noArg": "You can't use the `prefix` command without arguments !",
        "update": "The command prefix has changed : you can now call a command with `<prefix>`",
        "updateError": "The prefix must be a one word string ! You tried to give the following one : `<prefix>`"
    },

    "reactionrole": {
        "description": "Add a role to a user after message reaction",
        "help": "Using the `reactionrole` command: reactionrole [--channel <channel>] [--role <role-name> <emoji>]\nThe subcommands (in square brackets) are optional. Used without arguments, this command will display the message from which users can react to get their role.\n\nThe --channel subcommand allows you to define in which channel the bot will listen to reactions to messages in order to assign roles. If no argument is specified for this sub-command, then the bot will indicate in which channel (if one has been configured beforehand) it is currently listening to the reactions to the messages.\n\nThe --role subcommand allows you to define the roles the bot can assign.\nTo add an assignable role with this sub-command, you must specify the name of the role and the emoji to use. For example, if you want the role 'Test' to be assignable with the emoji :partying_face:, then you would use the command as follows: `reactionrole --role test :partying_face:` Note that it is possible to set up multiple roles in a single command (Example: `reactionrole --role test :partying_face: test2 :eyes:`)\n\n**Note**: If a role has spaces in its name, they should be replaced with _. For example, to add the role 'Test Role', use `reactionrole --role test_role :partying_face:`\n\n**Caution**: If you are combining the use of subcommands, make sure that --role is used last",
        "embedTitle": "Choose your role",
        "embedDescription": "Choosing a role allows you to get access to the right channels !\n\n",
        "noRoleChannel": "There are no channel configured at the moment",
        "roleChannel": "The bot will assign roles on message reactions in <channel>",
        "roleChannelError": "`<channel>` is not an existing channel on this server !",
        "roleChannelUpdate": "The bot will now listen to reactions in <channel>",
        "noAssignableRole": "No role can be assigned by the bot at the moment",
        "embedTitleAssignableRole": "List of roles the bot can assign",
        "embedDescriptionAssignableRole": "The bot can assign the following roles :\n",
        "roleAssignArgError": "Caution ! You must give the role's name and then the emoji that will allow to assign this role.",
        "emojiError": "Impossible to use the following emoji(s): `<emoji>`"
    }   
}